{
  "raw": "Voici une liste de principes graphiques réutilisables basés sur la maquette fournie et sa structure design :\n\n---\n\n### Principes Graphiques Réutilisables\n\n**1. Palette de Couleurs :**\n*   **Vert Primaire (`#4CAF50` ou similaire) :** Utilisé pour l'identité de marque (HoméOS), les éléments actifs (onglets, titres de sections importants, icônes), les boutons d'action principaux et les liens.\n*   **Vert Foncée (`#2E7D32` ou similaire) :** Utilisé pour le texte sur les arrière-plans clairs, les icônes et les titres de sous-sections.\n*   **Arrière-plan Clair (`#F8F8F8` ou similaire) :** Utilisé pour le panneau de contenu gauche, indiquant les zones d'entrée ou de configuration.\n*   **Arrière-plan Sombre (`#1F1F1F` ou similaire) :** Utilisé pour le panneau de contenu droit, indiquant les zones d'affichage ou de résultat.\n*   **Blanc (`#FFFFFF`) :** Utilisé pour le texte sur les arrière-plans sombres et le texte des boutons verts primaires.\n*   **Gris Neutre (clair et foncé) :** Utilisé pour les bordures, les textes secondaires ou les éléments inactifs (ex: bordures des dropdowns).\n\n**2. Typographie :**\n*   **Famille de Polices :** Une police sans-serif moderne et lisible (ex: Roboto, Open Sans).\n*   **Hiérarchie des Titres :**\n    *   **Titres de Section Principaux :** Gras, grande taille de police, de couleur verte foncée (sur fond clair) ou blanche (sur fond sombre).\n    *   **Sous-titres/Labels Importants :** Gras, taille de police moyenne, couleur verte foncée.\n*   **Texte Corporel :** Régulier, taille de police plus petite, de couleur foncée (sur fond clair) ou blanche (sur fond sombre).\n*   **Texte Marque :** Spécifique (HoméOS Sullivan), utilise le vert primaire et est en gras.\n\n**3. Composants d'Interface Utilisateur :**\n*   **Boutons d'Action Principaux (Large Button, Call-to-Action Button) :**\n    *   Grande taille, forme rectangulaire (parfois légèrement arrondie pour le CTA final).\n    *   Arrière-plan vert primaire, texte blanc en majuscules.\n*   **Champs de Saisie et Dropdowns :**\n    *   Arrière-plan clair (blanc), bordure fine gris clair.\n    *   Texte de couleur foncée.\n    *   Icônes intégrées à gauche du texte (pour les champs de saisie avec icône).\n    *   Hauteur constante pour une cohérence visuelle.\n*   **Icônes :**\n    *   Monochromatiques (vert foncé sur fond clair, vert primaire/clair sur fond sombre).\n    *   Style épuré, basé sur des lignes.\n    *   Disposées en grille pour les collections d'icônes (\"Organes\").\n*   **Boîtes d'Information/Tooltip :**\n    *   Arrière-plan vert clair distinctif.\n    *   Coins légèrement arrondis.\n    *   Texte de couleur foncée, souvent accompagné d'une icône pertinente (ex: épingle de localisation).\n*   **Listes et Éléments de Navigation :**\n    *   Structure indentée pour indiquer la hiérarchie.\n    *   Titres de section de liste (ex: \"§1.3 Endpoints\") en vert.\n    *   Icônes d'expansion/réduction (flèches) en vert.\n\n**4. Disposition et Espacement :**\n*   **Layout en Deux Colonnes :**\n    *   Panneau gauche (clair) pour les entrées/configurations.\n    *   Panneau droit (sombre) pour les visualisations/résultats.\n    *   Cette division visuelle forte sert à séparer les types de contenu.\n*   **Navigation Principale :**\n    *   Utilise des onglets ou des blocs distincts en haut de page.\n    *   L'état actif est mis en évidence par un arrière-plan vert clair.\n*   **Espacement Cohérent :**\n    *   Un système d'espacement vertical et horizontal est appliqué pour créer une lisibilité et une hiérarchie claires entre les sections et les composants.\n    *   Padding interne dans les blocs de contenu.\n\n**5. Cohérence Visuelle Générale :**\n*   **Minimalisme :** Utilisation de couleurs et de styles épurés pour une interface propre et fonctionnelle.\n*   **Utilisation du Vert :** Le vert est la couleur d'accentuation principale, utilisée pour attirer l'attention sur les éléments interactifs, les informations importantes et le branding.\n*   **Contraste :** Fort contraste entre le texte et l'arrière-plan pour une lisibilité optimale, notamment entre les panneaux gauche et droit.\n\n---",
  "principles": []
}